# Distributed revision control system
brew "git"
# Command-line fuzzy finder written in Go
brew "fzf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Terminal multiplexer
brew "tmux"
# Improved top (interactive process viewer)
brew "htop"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Find what models run on your hardware
brew "llmfit"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Language server for the Go language
brew "gopls"
